load-test/sync-results.log
k6 run --env TEST_TYPE=sync --summary-export=sync-summary.json load-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ syncRequest OK

     checks.........................: 100.00% 32708 out of 32708
     data_received..................: 20 MB   94 kB/s
     data_sent......................: 3.1 MB  15 kB/s
     http_req_blocked...............: avg=5.34µs   min=0s     med=0s       max=8.32ms p(90)=0s       p(95)=0s       p(99)=0s
     http_req_connecting............: avg=1.65µs   min=0s     med=0s       max=1.9ms  p(90)=0s       p(95)=0s       p(99)=0s
     http_req_duration..............: avg=413.12ms min=6.22ms med=344.31ms max=1.33s  p(90)=634.98ms p(95)=641.32ms p(99)=681.12ms
       { expected_response:true }...: avg=413.12ms min=6.22ms med=344.31ms max=1.33s  p(90)=634.98ms p(95)=641.32ms p(99)=681.12ms
     http_req_failed................: 0.00%   0 out of 32708
     http_req_receiving.............: avg=162.76µs min=0s     med=0s       max=2.52ms p(90)=528.2µs  p(95)=539.66µs p(99)=834.38µs
     http_req_sending...............: avg=14.66µs  min=0s     med=0s       max=1.52ms p(90)=0s       p(95)=0s       p(99)=527.2µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s     p(90)=0s       p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=412.94ms min=6.02ms med=344.16ms max=1.33s  p(90)=634.75ms p(95)=641.13ms p(99)=681.03ms
     http_reqs......................: 32708   155.751603/s
     iteration_duration.............: avg=413.23ms min=6.22ms med=344.46ms max=1.33s  p(90)=635.05ms p(95)=641.43ms p(99)=681.12ms
     iterations.....................: 32708   155.751603/s
     vus............................: 1       min=1              max=100
     vus_max........................: 100     min=100            max=100


running (3m30.0s), 000/100 VUs, 32708 complete and 0 interrupted iterations
default ✓ [======================================] 000/100 VUs  3m30s


After database load:

k6 run --env TEST_TYPE=sync --summary-export=sync-summary.json load-test/load-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-test/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ syncRequest OK

     checks.........................: 100.00% 11295 out of 11295
     data_received..................: 41 MB   196 kB/s
     data_sent......................: 1.1 MB  5.2 kB/s
     http_req_blocked...............: avg=8.18µs   min=0s      med=0s    max=8.28ms  p(90)=0s      p(95)=0s       p(99)=519µs
     http_req_connecting............: avg=4.37µs   min=0s      med=0s    max=872.8µs p(90)=0s      p(95)=0s       p(99)=0s
     http_req_duration..............: avg=1.19s    min=18.33ms med=1.02s max=3.47s   p(90)=1.84s   p(95)=1.86s    p(99)=2.02s
       { expected_response:true }...: avg=1.19s    min=18.33ms med=1.02s max=3.47s   p(90)=1.84s   p(95)=1.86s    p(99)=2.02s
     http_req_failed................: 0.00%   0 out of 11295
     http_req_receiving.............: avg=201.25µs min=0s      med=0s    max=5.21ms  p(90)=528.9µs p(95)=552.79µs p(99)=971.6µs
     http_req_sending...............: avg=16.47µs  min=0s      med=0s    max=1.02ms  p(90)=0s      p(95)=0s       p(99)=526.1µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s    max=0s      p(90)=0s      p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=1.19s    min=18.33ms med=1.02s max=3.47s   p(90)=1.84s   p(95)=1.86s    p(99)=2.02s
     http_reqs......................: 11295   53.783849/s
     iteration_duration.............: avg=1.19s    min=18.33ms med=1.02s max=3.47s   p(90)=1.84s   p(95)=1.86s    p(99)=2.02s
     iterations.....................: 11295   53.783849/s
     vus............................: 1       min=1              max=100
     vus_max........................: 100     min=100            max=100


running (3m30.0s), 000/100 VUs, 11295 complete and 0 interrupted iterations
default ✓ [======================================] 000/100 VUs  3m30s


After fixing N+1 load:

k6 run --env TEST_TYPE=sync --summary-export=load-test/sync-summary.json load-test/load-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-test/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ syncRequest OK

     checks.........................: 100.00% 32633 out of 32633
     data_received..................: 113 MB  538 kB/s
     data_sent......................: 3.3 MB  16 kB/s
     http_req_blocked...............: avg=4.8µs    min=0s     med=0s       max=7.8ms   p(90)=0s       p(95)=0s       p(99)=0s
     http_req_connecting............: avg=1.5µs    min=0s     med=0s       max=627.6µs p(90)=0s       p(95)=0s       p(99)=0s
     http_req_duration..............: avg=414.05ms min=7.66ms med=338.84ms max=1.22s   p(90)=640.84ms p(95)=646.61ms p(99)=659.43ms
       { expected_response:true }...: avg=414.05ms min=7.66ms med=338.84ms max=1.22s   p(90)=640.84ms p(95)=646.61ms p(99)=659.43ms
     http_req_failed................: 0.00%   0 out of 32633
     http_req_receiving.............: avg=153.1µs  min=0s     med=0s       max=4.21ms  p(90)=526.77µs p(95)=533.59µs p(99)=877.7µs
     http_req_sending...............: avg=13.82µs  min=0s     med=0s       max=1.52ms  p(90)=0s       p(95)=0s       p(99)=526.4µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s      p(90)=0s       p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=413.88ms min=7.66ms med=338.58ms max=1.22s   p(90)=640.66ms p(95)=646.46ms p(99)=659.31ms
     http_reqs......................: 32633   155.394912/s
     iteration_duration.............: avg=414.14ms min=7.66ms med=338.87ms max=1.22s   p(90)=640.97ms p(95)=646.71ms p(99)=659.55ms
     iterations.....................: 32633   155.394912/s
     vus............................: 1       min=1              max=100
     vus_max........................: 100     min=100            max=100


running (3m30.0s), 000/100 VUs, 32633 complete and 0 interrupted iterations
default ✓ [======================================] 000/100 VUs  3m30s


500 VUs:

k6 run --env TEST_TYPE=sync --summary-export=load-test/sync-summary.json load-test/load-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

    execution: local
        script: load-test/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 3m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ syncRequest OK
      ↳  98% — ✓ 32086 / ✗ 375

     checks.........................: 98.84% 32086 out of 32461
     data_received..................: 111 MB 529 kB/s
     data_sent......................: 3.3 MB 16 kB/s
     http_req_blocked...............: avg=18.35µs  min=0s     med=0s    max=3.09ms p(90)=0s      p(95)=0s    p(99)=531.69µs
     http_req_connecting............: avg=13.2µs   min=0s     med=0s    max=3.09ms p(90)=0s      p(95)=0s    p(99)=527.4µs
     http_req_duration..............: avg=2.23s    min=7.8ms  med=1.16s max=1m0s   p(90)=1.23s   p(95)=1.25s p(99)=59.99s
       { expected_response:true }...: avg=1.56s    min=7.8ms  med=1.16s max=59.94s p(90)=1.22s   p(95)=1.24s p(99)=24.91s
     http_req_failed................: 1.15%  375 out of 32461
     http_req_receiving.............: avg=160.72µs min=0s     med=0s    max=4.81ms p(90)=528.9µs p(95)=537µs p(99)=870.96µs
     http_req_sending...............: avg=35.14ms  min=0s     med=0s    max=30.01s p(90)=0s      p(95)=0s    p(99)=529.59µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s    max=0s     p(90)=0s      p(95)=0s    p(99)=0s
     http_req_waiting...............: avg=2.2s     min=7.8ms  med=1.16s max=1m0s   p(90)=1.23s   p(95)=1.25s p(99)=59.99s
     http_reqs......................: 32461  154.573351/s
     iteration_duration.............: avg=2.23s    min=7.81ms med=1.16s max=1m0s   p(90)=1.23s   p(95)=1.25s p(99)=1m0s
     iterations.....................: 32461  154.573351/s
     vus............................: 1      min=1              max=500
     vus_max........................: 500    min=500            max=500


running (3m30.0s), 000/500 VUs, 32461 complete and 0 interrupted iterations
default ✓ [======================================] 000/500 VUs  3m30s